Revit 2027 API
SunAndShadowSettings.GroundPlaneLevelId Property
 Identifies the element id of the Ground Plane level for the SunAndShadowSettings element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GroundPlaneLevelId { get; set; }
Public Property GroundPlaneLevelId As ElementId
	Get
	Set
public:
property ElementId^ GroundPlaneLevelId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member GroundPlaneLevelId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: the element level is not a valid Ground Plane Level element.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace